Revit 2026 API

# GeometryElementGetTransformed Method

---

Returns a transformed copy of the geometry in this element.

**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public GeometryElement GetTransformed(
	Transform transform
)
```
```vb
Public Function GetTransformed (
	transform As Transform
) As GeometryElement
```
```cpp
public:
GeometryElement^ GetTransformed(
	Transform^ transform
)
```
```fsharp
member GetTransformed :
        transform : Transform -> GeometryElement
```

#### Parameters

transform Transform
    The transformation to apply to the geometry.

#### Return Value

GeometryElement

| Exception | Condition |
| --- | --- |
| ArgumentException | Transform is not conformal |

#### Reference

GeometryElement Class

Autodesk.Revit.DB Namespace